#### [Warning: multiple data types in column of very large dataframe](https://stackoverflow.com/questions/38964819/warning-multiple-data-types-in-column-of-very-large-dataframe)

In [13]:
import pandas as pd
import numpy as np

In [14]:
df = pd.DataFrame(dict(col1=[1, 'A', 'B', 'C',np.nan,  False, np.nan, ['hello']],
                       col2=[2, 34, 6, 3.14,np.nan, 'hello', (1, 2, 3), True]))
df = pd.concat([df for _ in range(2)], ignore_index=True)

df

       col1       col2
0         1          2
1         A         34
2         B          6
3         C       3.14
4       NaN        NaN
5     False      hello
6       NaN  (1, 2, 3)
7   [hello]       True
8         1          2
9         A         34
10        B          6
11        C       3.14
12      NaN        NaN
13    False      hello
14      NaN  (1, 2, 3)
15  [hello]       True

In [15]:
df.col1.apply(type).value_counts()

<class 'str'>      6
<class 'float'>    4
<class 'int'>      2
<class 'bool'>     2
<class 'list'>     2
Name: col1, dtype: int64

In [76]:
data_type_column_freq = df.col1.apply(type).value_counts(normalize = True)
data_type_column_freq

<class 'str'>      0.375
<class 'float'>    0.250
<class 'int'>      0.125
<class 'bool'>     0.125
<class 'list'>     0.125
Name: col1, dtype: float64

In [77]:
mean_data_types = df.col1.apply(type).value_counts(normalize = True).mean()
mean_data_types

0.2

In [78]:
most_frequenty_data_type_in_column = list(data_type_column_freq[data_type_column_freq > mean_data_types].index)[0]
most_frequenty_data_type_in_column

str

In [79]:
df = df[df.col1.apply(type) == most_frequenty_data_type_in_column]
df

   col1  col2
1     A    34
2     B     6
3     C  3.14
9     A    34
10    B     6
11    C  3.14

In [80]:
df.col2.apply(type).value_counts()

<class 'int'>      4
<class 'float'>    2
Name: col2, dtype: int64

In [81]:
for i in df.columns:
    print(i)

col1
col2

### Loop

In [16]:
df = pd.DataFrame(dict(col1=[1, 'A', 'B', 'C',np.nan,  False, np.nan, ['hello']],
                       col2=[2, 34, 6, 3.14,np.nan, 'hello', (1, 2, 3), True]))
df = pd.concat([df for _ in range(2)], ignore_index=True)

df

       col1       col2
0         1          2
1         A         34
2         B          6
3         C       3.14
4       NaN        NaN
5     False      hello
6       NaN  (1, 2, 3)
7   [hello]       True
8         1          2
9         A         34
10        B          6
11        C       3.14
12      NaN        NaN
13    False      hello
14      NaN  (1, 2, 3)
15  [hello]       True

In [17]:
for col in df.columns:
    data_type_column_freq = df[col].apply(type).value_counts(normalize = True)
    mean_data_types = df[col].apply(type).value_counts(normalize = True).mean()
    most_frequenty_data_type_in_column = list(data_type_column_freq[data_type_column_freq > mean_data_types].index)[0]
    df = df[df[col].apply(type) == most_frequenty_data_type_in_column]

In [18]:
df

   col1 col2
1     A   34
2     B    6
9     A   34
10    B    6